# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO-FIX object detection model with enhanced modules from the paper
# Model docs: https://docs.ultralytics.com/models/yolo11
# Paper: YOLO-FIX: Improved YOLOv11 with Attention and Multi-Scale Feature Fusion for Detecting Glue Line Defects

# Parameters
nc: 175  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO-FIX backbone (enhanced YOLO11 with YOLO-FIX improvements)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4 # 12
  - [-1, 2, MLABlock, []] # 13 - MLABlock will use c1 as both input and output
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3 # 15
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 256]] # 16 (P3/8-small)
  
  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # cat head P4 # 18
  - [-1, 1, ContextGuidedBlock, []] # 19 - ContextGuidedBlock will use c1 as both input and output
  - [-1, 1, RepNCSPELAN4, [256]] # 20 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 10], 1, Concat, [1]] # cat head P5 # 22
  - [-1, 1, ContextGuidedBlock, []] # 23 - ContextGuidedBlock will use c1 as both input and output
  - [-1, 2, RepNCSPELAN4, [1024, True]] # 24 (P5/32-large)
  
  - [[16, 20, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)
