# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 175 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Thêm phần neck mới
neck:
  # Process P5 from backbone
  - [-1, 1, Conv, [512, 1, 1]]                # 11: Reduce channels from P5
  - [-1, 1, ContextGuidedBlock, [512]]        # 12: Context-guided block
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13: Upsample

  # Combine with P4 from backbone
  - [[-1, 6], 1, Concat, [1]]                 # 14: Concat with P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: Upsample

  # Combine with P3 from backbone
  - [[-1, 4], 1, Concat, [1]]                 # 16: Concat with P3

  # Feature fusion after all concatenations
  - [-1, 1, RepNCSPELAN, [512]]               # 17: Feature enhancement
  - [-1, 1, MLABlock, [512]]                  # 18: MLABlock for deep fusion

head:
  # P3 processing
  - [-1, 1, RepNCSPELAN, [256]]               # 19: P3 head
  - [-1, 1, Conv, [256, 3, 2]]                # 20: Downsample to P4 size

  # P4 processing
  - [[-1, 14], 1, Concat, [1]]                # 21: Concat with P4 neck feature (from index 14)
  - [-1, 1, RepNCSPELAN, [512]]               # 22: P4 head
  - [-1, 1, Conv, [512, 3, 2]]                # 23: Downsample to P5 size

  # P5 processing
  - [[-1, 11], 1, Concat, [1]]                # 24: Concat with P5 neck feature (from index 11)
  - [-1, 1, RepNCSPELAN, [1024]]              # 25: P5 head

  # Detection layer
  - [[19, 22, 25], 1, Detect, [nc]]           # 26: Detect on P3, P4, P5
